## repositories plan
```
module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.github.github_repository.default: Refreshing state... [id=.github]
module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.acronyms.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=acronyms:SLACK_WEBHOOK_URL]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_NAMESPACE"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_NAMESPACE]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_CERT"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_CERT]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_TOKEN"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_TOKEN]
module.cloud-platform-maintenance-pages.github_actions_secret.default["KUBE_CLUSTER"]: Refreshing state... [id=cloud-platform-maintenance-pages:KUBE_CLUSTER]
module.cloud-platform-maintenance-pages.github_actions_secret.default["ECR_ROLE_TO_ASSUME"]: Refreshing state... [id=cloud-platform-maintenance-pages:ECR_ROLE_TO_ASSUME]
module.github-collaborators.github_actions_secret.default["OPS_BOT_TOKEN_ENABLED"]: Refreshing state... [id=github-collaborators:OPS_BOT_TOKEN_ENABLED]
module.github-collaborators.github_actions_secret.default["OPS_BOT_TOKEN"]: Refreshing state... [id=github-collaborators:OPS_BOT_TOKEN]
module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.github-collaborators.github_actions_secret.default["SEND_TO_NOTIFY"]: Refreshing state... [id=github-collaborators:SEND_TO_NOTIFY]
module.github-collaborators.github_actions_secret.default["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=github-collaborators:AWS_SECRET_ACCESS_KEY]
module.github-collaborators.github_actions_secret.default["NOTIFY_TEST_TOKEN"]: Refreshing state... [id=github-collaborators:NOTIFY_TEST_TOKEN]
module.github-collaborators.github_actions_secret.default["POST_TO_GH"]: Refreshing state... [id=github-collaborators:POST_TO_GH]
module.github-collaborators.github_actions_secret.default["POST_TO_SLACK"]: Refreshing state... [id=github-collaborators:POST_TO_SLACK]
module.github-collaborators.github_actions_secret.default["APP_PEM_FILE"]: Refreshing state... [id=github-collaborators:APP_PEM_FILE]
module.github-collaborators.github_actions_secret.default["APP_INSTALLATION_ID"]: Refreshing state... [id=github-collaborators:APP_INSTALLATION_ID]
module.github-collaborators.github_actions_secret.default["AWS_ACCESS_KEY_ID"]: Refreshing state... [id=github-collaborators:AWS_ACCESS_KEY_ID]
module.github-collaborators.github_actions_secret.default["NOTIFY_PROD_TOKEN"]: Refreshing state... [id=github-collaborators:NOTIFY_PROD_TOKEN]
module.github-collaborators.github_actions_secret.default["SLACK_WEBHOOK_URL"]: Refreshing state... [id=github-collaborators:SLACK_WEBHOOK_URL]
module.github-collaborators.github_actions_secret.default["APP_ID"]: Refreshing state... [id=github-collaborators:APP_ID]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.acronyms.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "acronyms"
    }

  # module.acronyms.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "acronyms"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.acronyms.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "List of abbreviations used within the MoJ, and their definitions" -> "List of abbreviations used within the MoJ, and their definitions • This repository is defined and managed in Terraform"
        id                          = "acronyms"
        name                        = "acronyms"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.acronyms.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "acronyms"
      + tag_protection_id = (known after apply)
    }

  # module.cloud-platform-maintenance-pages.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "cloud-platform-maintenance-pages"
    }

  # module.cloud-platform-maintenance-pages.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cloud-platform-maintenance-pages"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.cloud-platform-maintenance-pages.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Web application to serve gov.uk maintenance pages for multiple domains" -> "Web application to serve gov.uk maintenance pages for multiple domains • This repository is defined and managed in Terraform"
        id                          = "cloud-platform-maintenance-pages"
        name                        = "cloud-platform-maintenance-pages"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cloud-platform-maintenance-pages.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "cloud-platform-maintenance-pages"
      + tag_protection_id = (known after apply)
    }

  # module.github.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = ".github"
    }

  # module.github.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = ".github"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.github.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Default organisational policies for the Ministry of Justice" -> "Default organisational policies for the Ministry of Justice • This repository is defined and managed in Terraform"
        id                          = ".github"
        name                        = ".github"
      ~ topics                      = [
          + "operations-engineering",
        ]
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = ".github"
      + tag_protection_id = (known after apply)
    }

  # module.github-actions.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "github-actions"
    }

  # module.github-actions.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "github-actions"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.github-actions.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "A github action which will run code formatters against PRs, and commit any resulting changes" -> "A github action which will run code formatters against PRs, and commit any resulting changes • This repository is defined and managed in Terraform"
        id                          = "github-actions"
        name                        = "github-actions"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.github-actions.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "github-actions"
      + tag_protection_id = (known after apply)
    }

  # module.github-collaborators.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "github-collaborators"
    }

  # module.github-collaborators.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "github-collaborators"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.github-collaborators.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Manage outside collaborators on our Github repositories" -> "Manage outside collaborators on our Github repositories • This repository is defined and managed in Terraform"
      ~ has_wiki                    = false -> true
        id                          = "github-collaborators"
        name                        = "github-collaborators"
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.github-collaborators.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "github-collaborators"
      + tag_protection_id = (known after apply)
    }

  # module.moj-terraform-aws-sso.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "moj-terraform-aws-sso"
    }

  # module.moj-terraform-aws-sso.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "moj-terraform-aws-sso"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.moj-terraform-aws-sso.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "A Terraform module for setting up AWS SSO and Auth0, to allow users to sign-in to AWS using GitHub" -> "A Terraform module for setting up AWS SSO and Auth0, to allow users to sign-in to AWS using GitHub • This repository is defined and managed in Terraform"
      ~ has_wiki                    = true -> false
        id                          = "moj-terraform-aws-sso"
        name                        = "moj-terraform-aws-sso"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.moj-terraform-aws-sso.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "moj-terraform-aws-sso"
      + tag_protection_id = (known after apply)
    }

  # module.moj-terraform-scim-github.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "moj-terraform-scim-github"
    }

  # module.moj-terraform-scim-github.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "moj-terraform-scim-github"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.moj-terraform-scim-github.github_repository.default will be updated in-place
  ~ resource "github_repository" "default" {
      + archive_on_destroy          = true
      ~ description                 = "Lambda function for automatic SCIM provisioning based on GitHub relationships" -> "Lambda function for automatic SCIM provisioning based on GitHub relationships • This repository is defined and managed in Terraform"
        id                          = "moj-terraform-scim-github"
        name                        = "moj-terraform-scim-github"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.moj-terraform-scim-github.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = "moj-terraform-scim-github"
      + tag_protection_id = (known after apply)
    }

Plan: 14 to add, 7 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```